# Расскажите о себе, используя максимальное количество типов данных
# https://i.imgur.com/Z6GCi81.png
name = 'Слава'  # string
age = 21  # integer
country = {'Россия': 'Санкт-Петербург'}  # dictionary
foot_size = 43.5  # float
documents = tuple('паспорт', 'страховой полис', 'снилс', 'медецинская карта')  # кортеж
books = list('Идиот', 'Человек который смеется', 'Собор парижской богоматери', 'О дивный новый мир')  # список
friends = set('Герман', 'Руслан', 'Артем', 'Никита')  # множество (рандом)
