base_pavlovsk = {
    'Место №1': [
        'Билет №7593096766601',
        'Маршрут: Saint-Petersburg -> Pavlovsk',
        'Пассажир: Петров Н.Е.',
        'Паспорт: 23 23 434343',
    ],
    'Место №2': [
        'Билет №7593096766602',
        'Маршрут: Saint-Petersburg -> Pavlovsk',
        'Пассажир: Куличев Н.Е.',
        'Паспорт: 24 24 444444',
    ],
    'Место №3': [
        'Билет №7593096766603',
        'Маршрут: Saint-Petersburg -> Pavlovsk',
        'Пассажир: Улуханов Н.Е.',
        'Паспорт: 25 25 454545',
    ],
}
base_vyborg = {
    'Место №1': [
        'Билет №7593096766601',
        'Маршрут: Saint-Petersburg -> Vyborg',
        'Пассажир: Петров Н.Е.',
        'Паспорт: 23 23 434343',
    ],
    'Место №2': [
        'Билет №7593096766602',
        'Маршрут: Saint-Petersburg -> Vyborg',
        'Пассажир: Куличев Н.Е.',
        'Паспорт: 24 24 444444',
    ],
    'Место №3': [
        'Билет №7593096766603',
        'Маршрут: Saint-Petersburg -> Vyborg',
        'Пассажир: Улуханов Н.Е.',
        'Паспорт: 25 25 454545',
    ],
}
base_kronstadt = {
    'Место №1': [
        'Билет №7593096766601',
        'Маршрут: Saint-Petersburg -> Kronstadt',
        'Пассажир: Петров Н.Е.',
        'Паспорт: 23 23 434343',
    ],
    'Место №2': [
        'Билет №7593096766602',
        'Маршрут: Saint-Petersburg -> Kronstadt',
        'Пассажир: Куличев Н.Е.',
        'Паспорт: 24 24 444444',
    ],
    'Место №3': [
        'Билет №7593096766603',
        'Маршрут: Saint-Petersburg -> Kronstadt',
        'Пассажир: Улуханов Н.Е.',
        'Паспорт: 25 25 454545',
    ],
}
